export const learn = [
	{
		title: 'Знание HTML и JavaScript для изучения JSX',
		description:
      'Одной из ключевых особенностей React является использование JSX, синтаксиса HTML-in-JavaScript. '
	},
	{
		title: 'Как долго уйдет на изучение React',
		description:
      'Изучение React может быть времязатратным, однако его популярность привела к тому, что на рынке всё больше и больше вакансий, которые требуют знания этой библиотеки.'
	},
	{
		title: 'Учить Реакт без знаний JavaScript — неверное решение',
		description:
      'Некоторые начинающие разработчики ошибочно думают, что можно начать изучать React, не зная базовый JavaScript. '
	},
	{
		title: 'Вывод',
		description:
      'Для успешного изучения React, необходимо хорошо знать базовый HTML, CSS и JavaScript.'
	}
];

export const differences = {
	html: 'HTML не является языком программирования; это язык разметки, и используется, чтобы сообщать вашему браузеру, как отображать веб-страницы, которые вы посещаете. ',
	css: 'Как и HTML, CSS на самом деле не является языком программирования. Это не язык разметки - это язык таблицы стилей. Это означает, что он позволяет применять стили выборочно к элементам в документах HTML. ',
	javascript:
    'JavaScript это язык, который позволяет вам применять сложные вещи на web странице — каждый раз, когда на web странице происходит что-то большее, чем просто её статичное отображение — отображение периодически обновляемого контента'
};
