export const learn = [
	{
		title: 'Знание HTML и JavaScript для изучения JSX',
		description:
      'Одной из ключевых особенностей React является использование JSX, синтаксиса HTML-in-JavaScript. Для того чтобы освоить JSX, необходимо хорошо знать HTML и JavaScript. Иначе будет трудно определить, связаны ли ошибки в вашем приложении с JavaScript или с более специфической областью React.'
	},
	{
		title: 'Как долго уйдет на изучение React',
		description:
      'Изучение React может быть времязатратным, однако его популярность привела к тому, что на рынке всё больше и больше вакансий, которые требуют знания этой библиотеки. Если вы уже знакомы с базовым JavaScript и HTML, на изучение React уйдет примерно 2 месяца.'
	},
	{
		title: 'Учить Реакт без знаний JavaScript — неверное решение',
		description:
      'Некоторые начинающие разработчики ошибочно думают, что можно начать изучать React, не зная базовый JavaScript. Однако, это грубая ошибка, так как для освоения React необходимо хорошо знать JavaScript.'
	},
	{
		title: 'Вывод',
		description:
      'Для успешного изучения React, необходимо хорошо знать базовый HTML, CSS и JavaScript. Если вы новичок в веб-разработке, изучение React может занять около 2-3 месяцев. Однако, в желании и упорстве никто не может вам помешать достичь желаемых результатов. Рекомендуется начинать с малых, делать учебные проекты, далее создавать свои проекты и постоянно обучаться новому функционалу веб-разработки и React JS.'
	}
];

export const differences = {
	html: 'HTML не является языком программирования; это язык разметки, и используется, чтобы сообщать вашему браузеру, как отображать веб-страницы, которые вы посещаете. ',
	css: 'Как и HTML, CSS на самом деле не является языком программирования. Это не язык разметки - это язык таблицы стилей. Это означает, что он позволяет применять стили выборочно к элементам в документах HTML. ',
	javascript:
    'JavaScript это язык, который позволяет вам применять сложные вещи на web странице — каждый раз, когда на web странице происходит что-то большее, чем просто её статичное отображение — отображение периодически обновляемого контента'
};
